{
  "patch_cfg": {
    "transformers_version": "5.6.2",
    "architectures": null,
    "output_hidden_states": false,
    "return_dict": true,
    "dtype": null,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "problem_type": null,
    "num_input_channels": 44,
    "context_length": 360,
    "distribution_output": "student_t",
    "loss": "mse",
    "patch_length": 30,
    "patch_stride": 30,
    "num_hidden_layers": 4,
    "d_model": 256,
    "num_attention_heads": 8,
    "share_embedding": true,
    "channel_attention": false,
    "ffn_dim": 512,
    "norm_type": "batchnorm",
    "norm_eps": 1e-05,
    "attention_dropout": 0.0,
    "positional_dropout": 0.0,
    "path_dropout": 0.0,
    "ff_dropout": 0.0,
    "bias": true,
    "activation_function": "gelu",
    "pre_norm": true,
    "positional_encoding_type": "sincos",
    "use_cls_token": false,
    "init_std": 0.02,
    "share_projection": true,
    "scaling": "std",
    "do_mask_input": true,
    "mask_type": "random",
    "random_mask_ratio": 0.4,
    "num_forecast_mask_patches": [
      2
    ],
    "channel_consistent_masking": false,
    "unmasked_channel_indices": null,
    "mask_value": 0,
    "pooling_type": "mean",
    "head_dropout": 0.0,
    "prediction_length": 24,
    "num_targets": 1,
    "output_range": null,
    "num_parallel_samples": 100,
    "_name_or_path": "",
    "dropout": 0.2,
    "model_type": "patchtst",
    "output_attentions": false
  },
  "train_cfg": {
    "context_length": 360,
    "patch_length": 30,
    "patch_stride": 30,
    "d_model": 256,
    "n_heads": 8,
    "n_layers": 4,
    "dropout": 0.2,
    "mask_ratio": 0.4,
    "batch_size": 64,
    "lr": 0.0003,
    "weight_decay": 0.0001,
    "epochs": 20,
    "grad_clip": 1.0,
    "seed": 0
  }
}